<a href="https://colab.research.google.com/github/yaajnu/ColabNotebooks/blob/master/KPMG_Data_Analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df=pd.ExcelFile('KPMG{STAGE 1).xlsx')
df.sheet_names

['Title Sheet',
 'Transactions',
 'NewCustomerList',
 'CustomerDemographic',
 'CustomerAddress']

In [ ]:
df1=pd.read_excel(df,"Transactions",header=None,skiprows=1)
df1.columns=df1.loc[0].values

In [ ]:
df1.drop(0,inplace=True)

In [ ]:
df1=df1[df1['customer_id'].duplicated()]

In [ ]:
df1

      transaction_id product_id  ... standard_cost product_first_sold_date
1                  1          2  ...         53.62                   41245
2                  2          3  ...        388.92                   41701
3                  3         37  ...        248.82                   36361
4                  4         88  ...         381.1                   36145
5                  5         78  ...        709.48                   42226
...              ...        ...  ...           ...                     ...
19996          19996         51  ...        1203.4                   37823
19997          19997         41  ...        312.74                   35560
19998          19998         87  ...         44.71                   40410
19999          19999          6  ...        136.73                   38216
20000          20000         11  ...       1580.47                   36334

[20000 rows x 13 columns]

In [ ]:
df1['order_status'].unique()

array(['Approved', 'Cancelled'], dtype=object)

In [ ]:
len(df1['customer_id'].unique())

3494

In [ ]:
df1.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [ ]:
df2=pd.read_excel(df,"CustomerAddress",header=None,skiprows=1)
df2

                0                          1  ...          4                   5
0     customer_id                    address  ...    country  property_valuation
1               1         060 Morning Avenue  ...  Australia                  10
2               2        6 Meadow Vale Court  ...  Australia                  10
3               4         0 Holy Cross Court  ...  Australia                   9
4               5        17979 Del Mar Point  ...  Australia                   4
...           ...                        ...  ...        ...                 ...
3995         3999            1482 Hauk Trail  ...  Australia                   3
3996         4000  57042 Village Green Point  ...  Australia                   6
3997         4001     87 Crescent Oaks Alley  ...  Australia                  10
3998         4002           8194 Lien Street  ...  Australia                   7
3999         4003            320 Acker Drive  ...  Australia                   7

[4000 rows x 6 columns]

In [ ]:
df2.columns=df2.loc[0].values

In [ ]:
df2=df2.drop(0)

In [ ]:
df2[df2['postcode']==2047]

      customer_id              address  ...    country property_valuation
46              0   957 Veith Junction  ...  Australia                 10
385             0  8 Holy Cross Center  ...  Australia                  9
1639            0  78 Bultman Junction  ...  Australia                 10
1751            0     78 Jackson Point  ...  Australia                 11
1785            0  0380 Chinook Avenue  ...  Australia                 12
1862            0    007 Canary Circle  ...  Australia                 12
2867            0  60717 Farmco Center  ...  Australia                 12
3368            0     42554 Randy Road  ...  Australia                 12
3783            0     1 Carey Crossing  ...  Australia                 10

[9 rows x 6 columns]

In [ ]:
df2['customer_id']=df2['customer_id'].apply(lambda x:x if x in list(df2[df2['customer_id'].duplicated()]['customer_id'].values) else 0)

In [ ]:
df2=df2.rename(columns={0:"a"})

In [ ]:
df2[df2['customer_id']!=0]

Empty DataFrame
Columns: [customer_id, address, postcode, state, country, property_valuation]
Index: []

In [ ]:
df2

     customer_id                    address  ...    country property_valuation
1              1         060 Morning Avenue  ...  Australia                 10
2              2        6 Meadow Vale Court  ...  Australia                 10
3              4         0 Holy Cross Court  ...  Australia                  9
4              5        17979 Del Mar Point  ...  Australia                  4
5              6           9 Oakridge Court  ...  Australia                  9
...          ...                        ...  ...        ...                ...
3995        3999            1482 Hauk Trail  ...  Australia                  3
3996        4000  57042 Village Green Point  ...  Australia                  6
3997        4001     87 Crescent Oaks Alley  ...  Australia                 10
3998        4002           8194 Lien Street  ...  Australia                  7
3999        4003            320 Acker Drive  ...  Australia                  7

[3999 rows x 6 columns]

In [ ]:
import numpy as np

In [ ]:
df2.isnull().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [ ]:
df2.replace('  ', np.nan, inplace=True)

In [ ]:
df3=pd.read_excel(df,'CustomerDemographic',header=None,skiprows=1)
df3

               0           1   ...        11      12
0     customer_id  first_name  ...  owns_car  tenure
1               1     Laraine  ...       Yes      11
2               2         Eli  ...       Yes      16
3               3       Arlin  ...       Yes      15
4               4      Talbot  ...        No       7
...           ...         ...  ...       ...     ...
3996         3996     Rosalia  ...        No      19
3997         3997      Blanch  ...       Yes       1
3998         3998      Sarene  ...        No     NaN
3999         3999   Patrizius  ...       Yes      10
4000         4000       Kippy  ...        No      11

[4001 rows x 13 columns]

In [ ]:
df3.columns=df3.loc[0].values
df3

      customer_id  first_name  ...  owns_car  tenure
0     customer_id  first_name  ...  owns_car  tenure
1               1     Laraine  ...       Yes      11
2               2         Eli  ...       Yes      16
3               3       Arlin  ...       Yes      15
4               4      Talbot  ...        No       7
...           ...         ...  ...       ...     ...
3996         3996     Rosalia  ...        No      19
3997         3997      Blanch  ...       Yes       1
3998         3998      Sarene  ...        No     NaN
3999         3999   Patrizius  ...       Yes      10
4000         4000       Kippy  ...        No      11

[4001 rows x 13 columns]

In [ ]:
df3=df3.drop('default',axis=1)

In [ ]:
df3.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                  87
dtype: int64

In [ ]:
df3[df3['deceased_indicator']=='Y']

     customer_id first_name    last_name  ... deceased_indicator owns_car tenure
753          753       Josy  St. Quentin  ...                  Y      Yes      6
3790        3790     Kurtis       Morson  ...                  Y      Yes      9

[2 rows x 12 columns]

In [ ]:
df3['default'].head(15)

1                                                    "'
2                          <script>alert('hi')</script>
3                                   2018-02-01 00:00:00
4     () { _; } >_[$($())] { touch /tmp/blns.shellsh...
5                                                   NIL
6                                              ðµ ð ð ð
7                                             â°â´âµâââ
8                               (â¯Â°â¡Â°ï¼â¯ï¸µ â»ââ»)
9                                                   0/0
10                                                 ð©ð½
11                                   ÅâÂ´Â®â Â¥Â¨ËÃ¸Ïââ
12                                                  nil
13                                                 -100
14                                               â°â´âµ
15                                                    ð
Name: default, dtype: object

In [ ]:
df3['gender'].unique()

array(['F', 'M', 'U'], dtype=object)

In [ ]:
df3['gender']=df3['gender'].apply(lambda x:'F' if x in['F','Female','Femal'] else x)

1          F
2       Male
3       Male
4       Male
5          F
        ...
3996       F
3997       F
3998       U
3999    Male
4000    Male
Name: gender, Length: 4000, dtype: object

In [ ]:
df3['gender']=df3['gender'].apply(lambda x:'M' if x in['M','Male'] else x)

In [ ]:
df3_edited=df3.drop(df3[df3['tenure'].isna()].index)

In [ ]:
df3_edited['last_name'].fillna(method='ffill',inplace=True)

In [ ]:
df3_edited.isna().sum()

customer_id                              0
first_name                               0
last_name                                0
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                      0
job_title                              392
job_industry_category                    0
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
dtype: int64

In [ ]:
df3_edited.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3257 entries, 1 to 3999
Data columns (total 12 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          3257 non-null   object
 1   first_name                           3257 non-null   object
 2   last_name                            3257 non-null   object
 3   gender                               3257 non-null   object
 4   past_3_years_bike_related_purchases  3257 non-null   object
 5   DOB                                  3257 non-null   object
 6   job_title                            2865 non-null   object
 7   job_industry_category                3257 non-null   object
 8   wealth_segment                       3257 non-null   object
 9   deceased_indicator                   3257 non-null   object
 10  owns_car                             3257 non-null   object
 11  tenure                               3257 non-null   object
dtypes: object(12)
memory usage: 330.8+ KB

In [ ]:
(df3_edited['job_industry_category'].unique())

array(['Health', 'Financial Services', 'Property', 'IT', nan, 'Retail',
       'Argiculture', 'Manufacturing', 'Telecommunications',
       'Entertainment'], dtype=object)

In [ ]:
df3_edited=df3_edited.drop(df3_edited[df3_edited['job_industry_category'].isna()].index)

In [ ]:
df3_processed=df3_edited.drop('job_title',axis=1)
df3_processed.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3257 entries, 1 to 3999
Data columns (total 11 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          3257 non-null   object
 1   first_name                           3257 non-null   object
 2   last_name                            3257 non-null   object
 3   gender                               3257 non-null   object
 4   past_3_years_bike_related_purchases  3257 non-null   object
 5   DOB                                  3257 non-null   object
 6   job_industry_category                3257 non-null   object
 7   wealth_segment                       3257 non-null   object
 8   deceased_indicator                   3257 non-null   object
 9   owns_car                             3257 non-null   object
 10  tenure                               3257 non-null   object
dtypes: object(11)
memory usage: 305.3+ KB

In [ ]:
df3_processed.isna().sum()

customer_id                            0
first_name                             0
last_name                              0
gender                                 0
past_3_years_bike_related_purchases    0
DOB                                    0
job_industry_category                  0
wealth_segment                         0
deceased_indicator                     0
owns_car                               0
tenure                                 0
dtype: int64

In [ ]:
df_merged=pd.merge(df3_processed,df2,left_on='customer_id',right_on='customer_id')

Int64Index([627, 3087], dtype='int64')

In [ ]:
df_merged.drop(df_merged[df_merged['deceased_indicator']=='Y'].index,inplace=True)

In [ ]:
df_merged

     customer_id first_name  ...    country property_valuation
0              1    Laraine  ...  Australia                 10
1              2        Eli  ...  Australia                 10
2              4     Talbot  ...  Australia                  9
3              6       Curr  ...  Australia                  9
4              7       Fina  ...  Australia                  9
...          ...        ...  ...        ...                ...
3249        3994    Stephie  ...  Australia                  2
3250        3995      Rusty  ...  Australia                 12
3251        3996    Rosalia  ...  Australia                  6
3252        3997     Blanch  ...  Australia                  2
3253        3999  Patrizius  ...  Australia                  3

[3252 rows x 16 columns]

In [ ]:
df_final=pd.merge(df1,df_merged,left_on='customer_id',right_on='customer_id')

      customer_id online_order  ...    country property_valuation
0            2950        False  ...  Australia                  6
1            2950        False  ...  Australia                  6
2            2950        False  ...  Australia                  6
3            3120         True  ...  Australia                  5
4            3120        False  ...  Australia                  5
...           ...          ...  ...        ...                ...
16287         130         True  ...  Australia                  7
16288        2789        False  ...  Australia                 11
16289        2789        False  ...  Australia                 11
16290        3446         True  ...  Australia                  4
16291        3446        False  ...  Australia                  4

[16292 rows x 25 columns]

In [ ]:
df_final.drop(['transaction_id','product_id','transaction_date','first_name','last_name','country','address','deceased_indicator','DOB','brand'],axis=1,inplace=True)

In [ ]:
df_final['wealth_segment'].unique()

array(['Mass Customer', 'Affluent Customer', 'High Net Worth'],
      dtype=object)

In [ ]:
df_final.set_index('customer_id',inplace=True)

KeyError: ignored

In [ ]:
labels=df_final[['standard_cost','order_status']]

In [ ]:
df_final.to_csv('Data_tobepreprocessed.csv')

TASK 2

In [ ]:
import pandas as pd

In [ ]:
df_task2=pd.ExcelFile('KPMG(STAGE 2).xlsx')

In [ ]:
df_task2.sheet_names

['Title Sheet',
 'Transactions',
 'NewCustomerList',
 'CustomerDemographic',
 'CustomerAddress']